# Chapter 7

# Data Cleaning and Preparation

## 7.1: Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df = pd.DataFrame(np.random.randn(7, 3))

In [17]:
df.iloc[:4, 1] = NA

In [18]:
df.iloc[:2, 2] = NA

In [19]:
df

          0         1         2
0  1.232379       NaN       NaN
1  0.232969       NaN       NaN
2  0.997639       NaN -0.554155
3  1.373303       NaN -0.083409
4  0.666110  0.205367  0.035425
5 -0.006299 -0.418212  0.674459
6  0.781485  1.071401  0.835305

In [20]:
df.dropna()

          0         1         2
4  0.666110  0.205367  0.035425
5 -0.006299 -0.418212  0.674459
6  0.781485  1.071401  0.835305

In [21]:
df.dropna(thresh=2)

          0         1         2
2  0.997639       NaN -0.554155
3  1.373303       NaN -0.083409
4  0.666110  0.205367  0.035425
5 -0.006299 -0.418212  0.674459
6  0.781485  1.071401  0.835305

### Filling in Missing Data

In [22]:
df.fillna(0)

          0         1         2
0  1.232379  0.000000  0.000000
1  0.232969  0.000000  0.000000
2  0.997639  0.000000 -0.554155
3  1.373303  0.000000 -0.083409
4  0.666110  0.205367  0.035425
5 -0.006299 -0.418212  0.674459
6  0.781485  1.071401  0.835305

In [23]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.232379  0.500000  0.000000
1  0.232969  0.500000  0.000000
2  0.997639  0.500000 -0.554155
3  1.373303  0.500000 -0.083409
4  0.666110  0.205367  0.035425
5 -0.006299 -0.418212  0.674459
6  0.781485  1.071401  0.835305

In [24]:
_ = df.fillna(0, inplace=True)

In [25]:
df

          0         1         2
0  1.232379  0.000000  0.000000
1  0.232969  0.000000  0.000000
2  0.997639  0.000000 -0.554155
3  1.373303  0.000000 -0.083409
4  0.666110  0.205367  0.035425
5 -0.006299 -0.418212  0.674459
6  0.781485  1.071401  0.835305

In [26]:
df = pd.DataFrame(np.random.randn(6, 3))

In [27]:
df.iloc[2:, 1] = NA

In [28]:
df.iloc[4:, 2] = NA

In [29]:
df

          0         1         2
0  0.365410  0.022298 -0.528708
1 -1.112241  1.327630  0.443403
2  2.082829       NaN -0.206289
3  0.010990       NaN -1.597301
4 -0.288660       NaN       NaN
5  0.590241       NaN       NaN

In [30]:
df.fillna(method='ffill')

          0         1         2
0  0.365410  0.022298 -0.528708
1 -1.112241  1.327630  0.443403
2  2.082829  1.327630 -0.206289
3  0.010990  1.327630 -1.597301
4 -0.288660  1.327630 -1.597301
5  0.590241  1.327630 -1.597301

In [31]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.365410  0.022298 -0.528708
1 -1.112241  1.327630  0.443403
2  2.082829  1.327630 -0.206289
3  0.010990  1.327630 -1.597301
4 -0.288660       NaN -1.597301
5  0.590241       NaN -1.597301

In [32]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [33]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2: Data Transformation

### Removing Duplicates

In [34]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [35]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [36]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [38]:
data['v1'] = range(7)

In [39]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [40]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [42]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [43]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [44]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [45]:
lowercased = data['food'].str.lower()

In [46]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [47]:
data['animal'] = lowercased.map(meat_to_animal)

In [48]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [49]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [50]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [51]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [52]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [53]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [54]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [55]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [56]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [57]:
transform = lambda x: x[:4].upper()

In [58]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [59]:
data.index = data.index.map(transform)

In [60]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [61]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [62]:
data.rename(index={'OHIO': 'INDIANA'},
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [63]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [64]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [65]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [66]:
bins = [18, 25, 35, 60, 100]

In [67]:
cats = pd.cut(ages, bins)

In [68]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [69]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [70]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [71]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [72]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [73]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [74]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [75]:
data = np.random.rand(20)

In [76]:
pd.cut(data, 4, precision=2)

[(0.067, 0.3], (0.067, 0.3], (0.76, 0.99], (0.53, 0.76], (0.067, 0.3], ..., (0.76, 0.99], (0.067, 0.3], (0.76, 0.99], (0.3, 0.53], (0.3, 0.53]]
Length: 20
Categories (4, interval[float64]): [(0.067, 0.3] < (0.3, 0.53] < (0.53, 0.76] < (0.76, 0.99]]

In [77]:
data = np.random.randn(1000)

In [78]:
cats = pd.qcut(data, 4)

In [79]:
cats

[(-3.799, -0.732], (0.663, 3.284], (0.663, 3.284], (-0.732, 0.00743], (-0.732, 0.00743], ..., (0.663, 3.284], (0.663, 3.284], (0.00743, 0.663], (0.00743, 0.663], (-0.732, 0.00743]]
Length: 1000
Categories (4, interval[float64]): [(-3.799, -0.732] < (-0.732, 0.00743] < (0.00743, 0.663] < (0.663, 3.284]]

In [80]:
pd.value_counts(cats)

(0.663, 3.284]       250
(0.00743, 0.663]     250
(-0.732, 0.00743]    250
(-3.799, -0.732]     250
dtype: int64

In [81]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.402, 0.00743], (0.00743, 1.306], (1.306, 3.284], (-1.402, 0.00743], (-1.402, 0.00743], ..., (0.00743, 1.306], (1.306, 3.284], (0.00743, 1.306], (0.00743, 1.306], (-1.402, 0.00743]]
Length: 1000
Categories (4, interval[float64]): [(-3.799, -1.402] < (-1.402, 0.00743] < (0.00743, 1.306] < (1.306, 3.284]]

### Detecting and Filtering Outliers

In [82]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [83]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.016932    -0.028154     0.007038    -0.056642
std       1.029774     0.976243     0.990036     0.983998
min      -3.152678    -3.154352    -3.122844    -3.306087
25%      -0.730656    -0.690631    -0.686192    -0.754033
50%      -0.055427    -0.027349    -0.021575    -0.059736
75%       0.718863     0.614181     0.727872     0.588636
max       3.155572     3.212933     2.807258     3.217519

In [84]:
col = data[2]

In [85]:
col[np.abs(col) > 3]

437   -3.122844
Name: 2, dtype: float64

In [86]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
55   3.155572  1.907902 -0.841603  0.978435
181  1.370028  0.581982  1.221329 -3.306087
278  0.378316  3.212933  0.339967 -0.563020
437 -0.173853 -0.768990 -3.122844 -0.885167
490 -0.513458 -0.569335 -0.564617  3.094260
562  3.147597 -0.568738 -0.672466  0.889098
583  1.697360 -0.027231  0.126060  3.217519
659 -0.968513 -3.154352 -1.235394  0.009015
679 -3.152678 -0.122805  2.193267  0.857580

In [87]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [88]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.017083    -0.028213     0.007161    -0.056648
std       1.028408     0.975076     0.989655     0.982034
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.730656    -0.690631    -0.686192    -0.754033
50%      -0.055427    -0.027349    -0.021575    -0.059736
75%       0.718863     0.614181     0.727872     0.588636
max       3.000000     3.000000     2.807258     3.000000

In [89]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1  1.0  1.0  1.0  1.0
2 -1.0  1.0 -1.0 -1.0
3 -1.0 -1.0 -1.0  1.0
4  1.0 -1.0 -1.0  1.0

### Permutation and Random Sampling

In [90]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [91]:
sampler = np.random.permutation(5)

In [92]:
sampler

array([0, 2, 4, 3, 1])

In [93]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [94]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7

In [95]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11

In [96]:
choices = pd.Series([5, 7, -1, 6, 4])

In [97]:
draws = choices.sample(n=10, replace=True)

In [98]:
draws

0    5
3    6
1    7
0    5
4    4
1    7
0    5
1    7
1    7
2   -1
dtype: int64

### Computing Indicator/Dummy Variables

In [99]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})

In [100]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [101]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [103]:
df_with_dummy = df[['data1']].join(dummies)

In [104]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [105]:
mnames = ['movie_id', 'title', 'genres']

In [106]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::', header=None, names=mnames)

<ipython-input-106-b5fb323bf003>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('datasets/movielens/movies.dat', sep='::', header=None, names=mnames)

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

## 7.2: String Manipulation

### String Object Methods

In [107]:
val = 'a,b,    guido'

In [108]:
val.split(',')

['a', 'b', '    guido']

In [109]:
pieces = [x.strip() for x in val.split(',')]

In [110]:
pieces

['a', 'b', 'guido']

In [111]:
first, second, third = pieces

In [112]:
first + '::' + second + '::' + third

'a::b::guido'

In [113]:
'::'.join(pieces)

'a::b::guido'

In [114]:
'guido' in val

True

In [115]:
val.index(',')

1

In [116]:
val.find(':')

-1

In [117]:
val.index(':')

ValueError: substring not found

In [118]:
val.count(',')

2

In [119]:
val.replace(',', '::')

'a::b::    guido'

In [120]:
val.replace(',', '')

'ab    guido'

### Regular Expressions

In [121]:
import re

In [122]:
text = "foo   bar\t baz  \tqux"

In [123]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [124]:
regex = re.compile('\s+')

In [125]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [126]:
regex.findall(text)

['   ', '\t ', '  \t']

In [127]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

regex = re.compile(pattern, flags=re.IGNORECASE)

In [128]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [129]:
m = regex.search(text)

In [130]:
m

In [131]:
text[m.start():m.end()]

'dave@google.com'

In [132]:
print(regex.match(text))

None

In [133]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [142]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [143]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [144]:
m = regex.match('wesm@bright.net')

In [145]:
m.groups()

('wesm', 'bright', 'net')

In [146]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [147]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [148]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [149]:
data = pd.Series(data)

In [150]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [151]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [152]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [153]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [154]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [155]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]

In [156]:
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [157]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [158]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [159]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN